tutorials/immersedBoundary/dynamicMesh/refiningMovingCylinderInChannelIco/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dynamicFvMesh   staticFvMesh;
// dynamicFvMesh   immersedBoundarySolidBodyMotionFvMesh;
dynamicFvMesh      immersedBoundaryDynamicRefineSolidBodyMotionFvMesh;

immersedBoundarySolidBodyMotionFvMeshCoeffs
{
    motionFunctions
    (
        ibCylinder
        {
            solidBodyMotionFunction     linearOscillation;
            linearOscillationCoeffs
            {
                amplitude    (0.5 0 0);
                period       2.5;
            }
        }
    );
}


immersedBoundaryDynamicRefineSolidBodyMotionFvMeshCoeffs
{
    motionFunctions
    (
        ibCylinder
        {
            solidBodyMotionFunction     linearOscillation;
            linearOscillationCoeffs
            {
                amplitude    (0.5 0 0);
                period       2.5;
            }
        }
    );

    refineInterval   2;

    maxRefLevel      2;

    maxCells         20000;

    coarseningDistance 0.15;

    refinementDistance 0.1;

    nBufferLayers     1;
}


// ************************************************************************* //
